Tekla.Structures.Drawing.IRelatedObjects
The IRelatedObjects interface is implemented by objects that have related objects.

Tekla.Structures.Drawing.IRelatedObjects.GetRelatedObjects
Gets the related objects of the current object.
Returns: The related objects of the current object.

Tekla.Structures.Drawing.IRelatedObjects.GetRelatedObjects(System.Type[])
Gets the related objects of the current object that are of certain types.
TypeFilter: The types of the objects to get.
Returns: The related objects of the current object that are of certain types.